https://www.youtube.com/watch?v=JrIG6Qtb4eg&list=PL_1pt6K-CLoDMEbYy2PcZuITWEjqMfyoA&index=2

Data analysis using dict

In [4]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\d\appdata\roaming\python\python311\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\d\appdata\roaming\python\python311\site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\d\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\d\appdata\roaming\python\python311\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\d\appdata\roaming\python\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\d\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

<b>Display top 3 data set</b>

In [5]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

<b>Display last 3 data set</b>

In [8]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

<b>Find the  shape of dataset(number of rows and column)</b>

In [9]:
#shape is an attribute i.e why not as shape()
df1.shape

(7, 3)

In [10]:
#as shape result in tuple, can access using index
print('Numbers of row ',df1.shape[0])
print('Numbers of column ',df1.shape[1])

Numbers of row  7
Numbers of column  3

<b>Total numnbers of rows and column with data type and memory required.</b>

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

<b>check null value</b>

In [12]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [13]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

Row wise null count

In [14]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

column wise null count

In [15]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

<b>Overall statistic of dataset:</b>

In [16]:
df1.describe()
# describe() give stats of numerical column. i.e marks here

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

<b>below code is re-executed because pc restarted</b>

In [8]:
import pandas as pd

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)

In [9]:
df1.describe(include='all')
#include='all' will give stats for all column

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

<b>find unique value from gender</b>

In [10]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

<b>find unique value's number from gender</b>

In [11]:
df1['Gender'].nunique()

2

<b>count of unique value in gender</b>

In [12]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [1]:
import pandas as pd

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)

<b>Find total number of student having marks between 90 to 100</b>

In [6]:
df1['Marks'] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [10]:
df1[df1['Marks'] >= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [12]:
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [17]:
#above can also be writtern as: using between()
sum(df1['Marks'].between(90,100))

4

In [13]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)])

4

<b>Find avg marks</b>

In [25]:
df1['Marks'].mean()
# also min(),Max()

92.14285714285714

<b>Apply method</b>

In [3]:
def mark_fun(x):
    return x/2

above created function and passing in apply method

In [3]:
df1['Marks'].apply(mark_fun)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

To add new column

In [4]:
df1['Half_marks']=df1['Marks'].apply(mark_fun)

To print table:

In [5]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

above can be achive using lambda function(i.e anomy function)

In [6]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

To find string length of name

In [8]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

<b>map()</b>

<b>Convert gender column male = 1 and female= 0</b>

In [10]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [11]:
df1['Male_female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half_marks  Male_female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

<b>To drop Male_female column:</b>

In [12]:
df1.drop('Male_female', axis=1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

<b>Drop multiple column and also commit use list [] for multiple column and inplace = True for saving that table</b>

In [13]:
df1.drop(['Male_female','Half_marks'], axis=1, inplace=True)

In [14]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

<b>Print column names</b>

In [15]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

<b>print indexes</b>

In [17]:
df1.index

RangeIndex(start=0, stop=7, step=1)

<b>Sort marks column</b>

In [19]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

df1.sort_values(by=['Marks','Gender'], ascending=False) //multiple column sorting, o/p is same as above both are female

<b>Name and marks of the female student only:</b>

In [40]:
df1[df1['Gender'] == 'Female'] [['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

<b>need more column than single use 2d list as above [['Name', 'Marks']]</b>

In [8]:
df1[df1['Name'] == 'Krisha']  ['Name']

2    Krisha
Name: Name, dtype: object